# Text_Transliteration_v1#(Input_String).py
# Транслитерация введеной строки

# https://www.cyberforum.ru/python-tasks/thread2186279.html

dic = {'Ь': '', 'ь': '', 'Ъ': '', 'ъ': '', 'А': 'A', 'а': 'a', 'Б': 'B', 'б': 'b', 'В': 'V', 'в': 'v',
       'Г': 'G', 'г': 'g', 'Д': 'D', 'д': 'd', 'Е': 'E', 'е': 'e', 'Ё': 'E', 'ё': 'e', 'Ж': 'Zh', 'ж': 'zh',
       'З': 'Z', 'з': 'z', 'И': 'I', 'и': 'i', 'Й': 'I', 'й': 'i', 'К': 'K', 'к': 'k', 'Л': 'L', 'л': 'l',
       'М': 'M', 'м': 'm', 'Н': 'N', 'н': 'n', 'О': 'O', 'о': 'o', 'П': 'P', 'п': 'p', 'Р': 'R', 'р': 'r',
       'С': 'S', 'с': 's', 'Т': 'T', 'т': 't', 'У': 'U', 'у': 'u', 'Ф': 'F', 'ф': 'f', 'Х': 'Kh', 'х': 'kh',
       'Ц': 'Tc', 'ц': 'tc', 'Ч': 'Ch', 'ч': 'ch', 'Ш': 'Sh', 'ш': 'sh', 'Щ': 'Shch', 'щ': 'shch', 'Ы': 'Y',
       'ы': 'y', 'Э': 'E', 'э': 'e', 'Ю': 'Iu', 'ю': 'iu', 'Я': 'Ia', 'я': 'ia'}

alphabet = ['Ь', 'ь', 'Ъ', 'ъ', 'А', 'а', 'Б', 'б', 'В', 'в', 'Г', 'г', 'Д', 'д', 'Е', 'е', 'Ё', 'ё',
            'Ж', 'ж', 'З', 'з', 'И', 'и', 'Й', 'й', 'К', 'к', 'Л', 'л', 'М', 'м', 'Н', 'н', 'О', 'о',
            'П', 'п', 'Р', 'р', 'С', 'с', 'Т', 'т', 'У', 'у', 'Ф', 'ф', 'Х', 'х', 'Ц', 'ц', 'Ч', 'ч',
            'Ш', 'ш', 'Щ', 'щ', 'Ы', 'ы', 'Э', 'э', 'Ю', 'ю', 'Я', 'я']

# ########################################################################################################
# dic = {'Ü': '', 'ü': '', 'Ú': '', 'ú': '', 'À': 'A', 'à': 'a', 'Á': 'B', 'á': 'b', 'Â': 'V',
#           'â': 'v', 'Ã': 'G', 'ã': 'g', 'Ä': 'D', 'ä': 'd', 'Å': 'E', 'å': 'e', '¨': 'Jo',
#           '¸': 'jo', 'Æ': 'Zh', 'æ': 'zh', 'Ç': 'Z', 'ç': 'z', 'È': 'I', 'è': 'i', 'É': 'J',
#           'é': 'j', 'Ê': 'K', 'ê': 'k', 'Ë': 'L', 'ë': 'l', 'Ì': 'M', 'ì': 'm', 'Í': 'N',
#           'í': 'n', 'Î': 'O', 'î': 'o', 'Ï': 'P', 'ï': 'p', 'Ð': 'R', 'ð': 'r', 'Ñ': 'S',
#           'ñ': 's', 'Ò': 'T', 'ò': 't', 'Ó': 'U', 'ó': 'u', 'Ô': 'F', 'ô': 'f', 'Õ': 'H',
#           'õ': 'h', 'Ö': 'Ñ', 'ö': 'c', '×': 'Ch', '÷': 'ch', 'Ø': 'Sh', 'ø': 'sh',
#           'Ù': 'Shh', 'ù': 'shh', 'Û': 'Y', 'û': 'y', "ü": "'", 'Ý': 'Je', 'ý': 'je', 'Þ': 'Ju',
#           'þ': 'ju', 'ß': 'Ya', 'ÿ': 'ya'}
#
# alphabet = ['Ü', 'ü', 'Ú', 'ú', 'À', 'à', 'Á', 'á', 'Â', 'â', 'Ã', 'ã', 'Ä', 'ä', 'Å', 'å', '¨', '¸',
#             'Æ', 'æ', 'Ç', 'ç', 'È', 'è', 'É', 'é', 'Ê', 'ê', 'Ë', 'ë', 'Ì', 'ì', 'Í', 'í', 'Î', 'î',
#             'Ï', 'ï', 'Ð', 'ð', 'Ñ', 'ñ', 'Ò', 'ò', 'Ó', 'ó', 'Ô', 'ô', 'Õ', 'õ', 'Ö', 'ö', '×', '÷',
#             'Ø', 'ø', 'Ù', 'ù', 'Û', 'û', 'Ý', 'ý', 'Þ', 'þ', 'ß', 'ÿ']
# ########################################################################################################

while True:
    st = str(input("Enter text: "))
    result = str()

    len_st = len(st)
    for i in range(0, len_st):
        if st[i] in alphabet:
            simb = dic[st[i]]
        else:
            simb = st[i]
        result = result + simb

    print(result)
